## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.keyvault.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "kv-aztf-log-prod-ne-03"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "rg-aztf-logging-prod-ne-02"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.keyvault.azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "northeurope"
      + name                            = "kv-aztf-log-prod-ne-03"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = false
      + resource_group_name             = "rg-aztf-logging-prod-ne-02"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tenant_id                       = "48c383d8-47c5-48f9-9e8b-afe4f2519054"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
          + ip_rules       = [
              + "13.74.50.171/32",
              + "84.10.55.110/32",
            ]
        }
    }

  # module.roleassignment-admin-kv.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "020a600a-b308-48ab-b860-ab7180455478"
      + principal_type                   = "User"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roleassignment-spn-kv.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c45e89ca-8212-45e9-8b55-f26b6040f9aa"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roleassignment-spn-kv2.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3ee74291-276c-4ffc-8475-52144540279c"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roleassignment-uami-kv.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02980afb-c222-4a6f-9436-fb7dad939c6a"
      + principal_type                   = "User"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Service Encryption User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>